app/views/posts/show.html.erb

    </p>
        <h2><%= pluralize(@post.comments.count, "comment")%></h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 5]]