app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.build(comment_params)

        # associating with user -- can also use merge in above line itself
        @comment.user_id = current_user.id

        @comment.save
---
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "comment by sai"], ["post_id", 1], ["created_at", "2017-07-25 02:24:43.292181"], ["updated_at", "2017-07-25 02:24:43.292181"], ["user_id", 1]]

    def destroy
        @user= User.find(current_user.id)
        @comment = @post.comments.find(params[:id])

        # checks corrent user
        redirect_to(root_url) unless current_user.id == @comment.user.id

        @comment.destroy
        redirect_to post_path(@post)
    end

    private def get_post
        @post = Post.find(params[:post_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 3], ["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]