app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @posts = Post.all.reverse_order

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "user1"], ["body", "post by user1"], ["user_id", 2], ["created_at", "2017-07-23 11:30:52.766403"], ["updated_at", "2017-07-23 11:30:52.766403"]]
---
    def create
        # current user to be asssociate d with posts in model
        @post = current_user.posts.build(post_params)
        if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "ohewad"], ["updated_at", "2017-07-25 12:56:59.439502"], ["id", 6]]
---
    def update
        if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def destroy
        @post.destroy
        redirect_to root_path
    end

    private def get_post
        @post = Post.find(params[:id])