app/views/layouts/_sidebar.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
            <li>logged in as <%= current_user.email %></li>
            <li><%= pluralize(current_user.posts.count, "image") %></li>
            <li><%= pluralize(current_user.comments.count, "comment") %></li>